In [1]:
import pandas as pd

In [2]:
data = {
    "employee_id": [1,2,3,4],
    "salary": [1000,1100,1200,1300],
    "age": [23,25,28,32]
}
data

{'employee_id': [1, 2, 3, 4],
 'salary': [1000, 1100, 1200, 1300],
 'age': [23, 25, 28, 32]}

In [3]:
df = pd.DataFrame(data)
df

   employee_id  salary  age
0            1    1000   23
1            2    1100   25
2            3    1200   28
3            4    1300   32

In [4]:
def suma_uno (numero):
    numero = numero + 1
    return numero

In [5]:
suma_uno(19)

20

In [6]:
df.apply(suma_uno)

   employee_id  salary  age
0            2    1001   24
1            3    1101   26
2            4    1201   29
3            5    1301   33

In [8]:
df["employee_id"].apply(suma_uno)

0    2
1    3
2    4
3    5
Name: employee_id, dtype: int64

In [9]:
l = lambda x: x+100

In [10]:
l(26)

126

In [12]:
df.apply(lambda row: row +1)

   employee_id  salary  age
0            2    1001   24
1            3    1101   26
2            4    1201   29
3            5    1301   33

In [13]:
df.apply(lambda row: row["employee_id"] +1, axis=1)

0    2
1    3
2    4
3    5
dtype: int64

In [15]:
#Para implementarlo
df["employee_id_correcto"] = df.apply(lambda row: row["employee_id"] +1, axis=1)
df

   employee_id  salary  age  employee_id_correcto
0            1    1000   23                     2
1            2    1100   25                     3
2            3    1200   28                     4
3            4    1300   32                     5

In [22]:
df["name"] = ["blanca", "jose luis", "kristina", "victor"]

In [17]:
df

   employee_id  salary  age  employee_id_correcto       name
0            1    1000   23                     2     blanca
1            2    1100   25                     3  jose luis
2            3    1200   28                     4   kristina
3            4    1300   32                     5     victor

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   employee_id           4 non-null      int64
 1   salary                4 non-null      int64
 2   age                   4 non-null      int64
 3   employee_id_correcto  4 non-null      int64
 4   name                  4 non-null      object
dtypes: int64(4), object(1)
memory usage: 288.0+ bytes

In [26]:
df.apply(lambda row: row["name"].capitalize(), axis=1)

0       Blanca
1    Jose luis
2     Kristina
3       Victor
dtype: object

In [28]:
df["name_capitalize"] = df.apply(lambda row: row["name"].capitalize(), axis=1)
df

   employee_id  salary  age  employee_id_correcto       name name_capitalize
0            1    1000   23                     2     blanca          Blanca
1            2    1100   25                     3  jose luis       Jose luis
2            3    1200   28                     4   kristina        Kristina
3            4    1300   32                     5     victor          Victor

In [29]:
df.apply(lambda row: row["name_capitalize"] + " - " + str(row["salary"]), axis="columns")

0       Blanca - 1000
1    Jose luis - 1100
2     Kristina - 1200
3       Victor - 1300
dtype: object

In [31]:
df["name_salary"] = df.apply(lambda row: row["name_capitalize"] + " - " + str(row["salary"]), axis="columns")
df

,employee_id,salary,age,employee_id_correcto,name,name_capitalize,name_salary
0,1,1000,23,2,blanca,Blanca,Blanca - 1000
1,2,1100,25,3,jose luis,Jose luis,Jose luis - 1100
2,3,1200,28,4,kristina,Kristina,Kristina - 1200
3,4,1300,32,5,victor,Victor,Victor - 1300

In [35]:
df.apply(lambda row: row["salary"] + 500 if row["name"] == "victor" else row["salary"], axis= 1)

0    1000
1    1100
2    1200
3    1800
dtype: int64

In [39]:
df["salary_increased"]=df.apply(lambda row: row["salary"] + 500 if row["name"] == "victor" else row["salary"]+300, axis= 1)
df

,employee_id,salary,age,employee_id_correcto,name,name_capitalize,name_salary,salary_increased
0,1,1000,23,2,blanca,Blanca,Blanca - 1000,1300
1,2,1100,25,3,jose luis,Jose luis,Jose luis - 1100,1400
2,3,1200,28,4,kristina,Kristina,Kristina - 1200,1500
3,4,1300,32,5,victor,Victor,Victor - 1300,1800

In [ ]:
df["salary"] = df["salary_increased"]